
{
  "format": "layers-model",
  "generatedBy": "keras v2.8.0",
  "convertedBy": "TensorFlow.js Converter v3.18.0",
  "modelTopology": {
    "keras_version": "2.8.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 48, 48, 1],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "conv2d_input"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "filters": 32,
              "kernel_size": [3, 3],
              "activation": "relu",
              "padding": "same"
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "pool_size": [2, 2]
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "filters": 64,
              "kernel_size": [3, 3],
              "activation": "relu",
              "padding": "same"
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "pool_size": [2, 2]
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "filters": 128,
              "kernel_size": [3, 3],
              "activation": "relu",
              "padding": "same"
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "pool_size": [2, 2]
            }
          },
          {
            "class_name": "Flatten",
            "config": {}
          },
          {
            "class_name": "Dense",
            "config": {
              "units": 128,
              "activation": "relu"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "units": 7,
              "activation": "softmax"
            }
          }
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["emotion_detector.weights.bin"],
      "weights": []
    }
  ]
}
